In [1]:
import pandas as pd

In [3]:
data = {
    'Name': ['Tom', 'nick', 'krish', 'jack', 'Tom', 'nick'],
    'Age': [20, 21, 19, 18, 20, 19],
}

# Create DataFrame
df = pd.DataFrame(data)

df

    Name  Age
0    Tom   20
1   nick   21
2  krish   19
3   jack   18
4    Tom   20
5   nick   19

In [ ]:
df.groupby(['Name'])['Age'].sum()

       Age
Name
Tom     40
jack    18
krish   19
nick    40

In [ ]:
df.groupby('Name')['Age'].nunique() == 1

Name
Tom       True
jack      True
krish     True
nick     False
Name: Age, dtype: bool